namespace SenYing.Common.Enum;

public enum VideoType
{
    默认 = 0,
    // 电视剧子类
    电视剧 = 1,
    日剧 = 6,
    马泰剧 = 7,
    内地剧 = 20,
    欧美剧 = 3,
    香港剧 = 4,
    韩剧 = 5,
    台湾剧 = 28,

    // 电影子类
    电影 = 2,
    恐怖片 = 13,
    动画片 = 23,
    剧情片 = 14,
    战争片 = 15,
    动作片 = 9,
    记录片 = 16,
    爱情片 = 10,
    喜剧片 = 11,
    科幻片 = 12,
    灾难片 = 34,
    悬疑片 = 35,
    犯罪片 = 36,

    // 动漫子类
    动漫 = 17,
    中国动漫 = 24,
    日本动漫 = 25,
    欧美动漫 = 26,

    // 综艺子类
    综艺 = 27,
    大陆综艺 = 30,
    日韩综艺 = 31,
    港台综艺 = 32,
    欧美综艺 = 33,

    // 其他分类
    短剧 = 38,

    待命 = 9999
}
